export const experienceData = [
  {
    id: 1,
    company: "小学校〜高校時代",
    position: "サッカー少年",
    period: "〜2018年",
    description: "引っ込み思案な子供でしたが、小学1年生から地元のサッカークラブに入れてもらい、休日や放課後はほとんどサッカーをして過ごしました。勉強も好きな方で、友人たちとテスト結果を競うのを楽しんでいました。"
  },
  {
    id: 2,
    company: "大学時代",
    position: "地元の外国語大学 英語専攻",
    period: "〜2022年3月",
    description: "座学の英語が得意だったので、実家から近い外大へ進学。英語を中心に、文系科目を幅広く学びました。2年生の終わりにコロナ禍になり、就活を見据え、総合職は無理だと悟っていたため、向いていそうなプログラミングを独学→そのまま就活、無事エンジニアとして内定をいただきました。"
  },
  {
    id: 3,
    company: "新卒時代 中規模Web系SIer",
    position: "エンジニア",
    period: "2022年4月 - 2025年5月（3年ほど）",
    description: "数百名規模のSIで、教育系サービスのバックエンドの保守を2年ほど経験（Rails） → 先方の社内システムの改修・新機能開発（Rails,Vue）。エンジニアとしてゼロから育てていただき、とても感謝しています。自社開発にチャレンジするため、転職を決意。"
  },
  {
    id: 4,
    company: "toB Saas 自社開発企業",
    position: "エンジニア",
    period: "2025年6月 - 現在",
    description: "エンジニア数名の、HR系サービスの保守・開発（Rails,React,GraphQL）。自社開発ならではの、要件定義フェーズからの参画、機能提案などプロダクト志向のエンジニアを意識しています。"
  }
];
