export const philosophyData = {
  title: "Philosophy",
  subtitle: "エンジニアとしての思いとスタンス",
  content: [
    {
      title: "プロダクト志向・ユーザー志向",
      description: "良いプロダクトを作るには、ユーザー目線で「これは必要か？使いやすいか？」を意識することが不可欠です。ただ要件に書かれた仕様で実装するだけではなく、その背景や課題を理解して開発することを心がけています。"
    },
    {
      title: "技術面の志向",
      description: "1人で全領域の実装をカバーできるフルスタックなエンジニアを目指しています。バックエンド（Rails）が得意領域ですが、フロント（Vue,React）もある程度は自立して実装できます。インフラはAWSのEC2が使える程度、修行中です。"
    },
    {
      title: "柔らかいコミュニケーション",
      description: "些細なことでも気軽に相談でき、活発に議論できるのが良いチームだと考えています。実装中にUIの疑問点をデザイナーに相談したり、PRのレビューで指摘したり、etc...。摩擦が生まれないよう、丁寧な口調、絵文字やスタンプの使用、強い否定を避けるなど、常に相手にリスペクトを持つことを心がけています。"
    }
  ]
};
